###############################################################################
# Created by write_sdc
# Sun May 24 08:22:39 2026
###############################################################################
current_design Murax
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name io_mainClk -period 25.0000 [get_ports {io_mainClk}]
set_clock_transition 0.1500 [get_clocks {io_mainClk}]
set_clock_uncertainty 0.2500 io_mainClk
set_propagated_clock [get_clocks {io_mainClk}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_asyncReset}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[0]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[10]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[11]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[12]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[13]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[14]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[15]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[16]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[17]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[18]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[19]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[1]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[20]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[21]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[22]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[23]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[24]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[25]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[26]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[27]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[28]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[29]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[2]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[30]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[31]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[3]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[4]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[5]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[6]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[7]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[8]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_read[9]}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_jtag_tck}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_jtag_tdi}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_jtag_tms}]
set_input_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_uart_rxd}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[0]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[10]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[11]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[12]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[13]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[14]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[15]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[16]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[17]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[18]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[19]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[1]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[20]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[21]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[22]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[23]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[24]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[25]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[26]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[27]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[28]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[29]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[2]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[30]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[31]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[3]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[4]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[5]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[6]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[7]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[8]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_writeEnable[9]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[0]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[10]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[11]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[12]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[13]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[14]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[15]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[16]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[17]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[18]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[19]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[1]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[20]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[21]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[22]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[23]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[24]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[25]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[26]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[27]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[28]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[29]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[2]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[30]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[31]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[3]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[4]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[5]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[6]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[7]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[8]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_gpioA_write[9]}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_jtag_tdo}]
set_output_delay 5.0000 -clock [get_clocks {io_mainClk}] -add_delay [get_ports {io_uart_txd}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {io_jtag_tdo}]
set_load -pin_load 0.0334 [get_ports {io_uart_txd}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[31]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[30]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[29]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[28]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[27]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[26]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[25]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[24]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[23]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[22]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[21]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[20]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[19]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[18]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[17]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[16]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[15]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[14]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[13]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[12]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[11]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[10]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[9]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[8]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[7]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[6]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[5]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[4]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[3]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[2]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[1]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_write[0]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[31]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[30]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[29]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[28]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[27]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[26]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[25]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[24]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[23]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[22]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[21]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[20]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[19]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[18]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[17]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[16]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[15]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[14]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[13]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[12]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[11]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[10]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[9]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[8]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[7]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[6]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[5]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[4]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[3]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[2]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[1]}]
set_load -pin_load 0.0334 [get_ports {io_gpioA_writeEnable[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_asyncReset}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_jtag_tck}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_jtag_tdi}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_jtag_tms}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_mainClk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_uart_rxd}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpioA_read[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
